http://www.runoob.com/python/python-mysql.html

# MySQLdb 基本操作

## 数据库连接

In [1]:
import MySQLdb

# 打开数据库连接
db = MySQLdb.connect("localhost","root","","option" )

# 使用cursor()方法获取操作游标 
cursor = db.cursor()

# 使用execute方法执行SQL语句
cursor.execute("SELECT VERSION()")

# 使用 fetchone() 方法获取一条数据
data = cursor.fetchone()

print "Database version : %s " % data

# 关闭数据库连接
db.close()

Database version : 10.1.29-MariaDB

## 创建数据库表

In [2]:
import MySQLdb


db = MySQLdb.connect('localhost', 'root', '', 'option')
cur = db.cursor()

## 如果存在则删除原有数据表
cur.execute('Drop table if exists employee')

## 创建数据表SQL语句
sql = """
        create table employee(
        first_name char(20) not null,
        last_name char(20),
        age int,
        sex char(1),
        income float)
        """

cur.execute(sql)
db.commit()
db.close()

C:\Anaconda2\lib\site-packages\ipykernel\__main__.py:8: Warning: Unknown table 'option.employee'

## 数据库插入操作

In [3]:
import MySQLdb
db = MySQLdb.connect('localhost', 'root', '', 'option')
cur = db.cursor()

## SQL 插入语句
sql = """INSERT INTO EMPLOYEE(FIRST_NAME,
         LAST_NAME, AGE, SEX, INCOME)
         VALUES ('Mac', 'Mohan', 20, 'M', 2000)"""

cur.execute(sql)
db.commit()

db.close()

## 数据库查询操作

In [26]:
import MySQLdb
db = MySQLdb.connect('localhost', 'root', '', 'option')
cur = db.cursor()

In [5]:
sql_find = """select * from employee"""
cur.execute(sql_find)
cur.fetchall()

(('Mac', 'Mohan', 20L, 'M', 2000.0),)

## 数据库更新操作

In [6]:
sql = """update employee set age = age +1 where sex = 'M'"""

In [7]:
cur.execute(sql)

1L

In [8]:
db.commit()

In [9]:
cur.execute(sql_find)
cur.fetchall()

(('Mac', 'Mohan', 21L, 'M', 2000.0),)

## 删除操作

In [10]:
sql_delete = """delete from employee where age >=20"""
cur.execute(sql_delete)
db.commit()

In [11]:
cur.execute(sql_find)
cur.fetchall()

()

In [12]:
db.close()

# panda 与 Mysql

## 写入数据

In [13]:
import pandas as pd
import numpy as np

from sqlalchemy import create_engine

engine = create_engine('mysql://root:@localhost/option')

data = pd.read_csv('vol_17_to_18.csv')
data.head()

data.to_sql('test', engine, if_exists='replace', index=False)

## 读入数据

In [14]:
from sqlalchemy import create_engine
engine = create_engine('mysql://root:@localhost/option')

In [15]:
data = pd.read_sql_table('test', engine)
data.head()

,code,date,end_date,start_date,strike,type,vol
0,10000017.SH,2015-02-06 00:00:00.005,2015-04-22 00:00:00.005,2015-02-09 00:00:00.005,2.25,认沽,NaN
1,10000017.SH,2015-02-09 00:00:00.005,2015-04-22 00:00:00.005,2015-02-09 00:00:00.005,2.25,认沽,0.380640
2,10000017.SH,2015-02-10 00:00:00.005,2015-04-22 00:00:00.005,2015-02-09 00:00:00.005,2.25,认沽,0.344061
3,10000017.SH,2015-02-11 00:00:00.005,2015-04-22 00:00:00.005,2015-02-09 00:00:00.005,2.25,认沽,0.292507
4,10000017.SH,2015-02-12 00:00:00.005,2015-04-22 00:00:00.005,2015-02-09 00:00:00.005,2.25,认沽,0.271417

In [16]:
## 或者使用sql语句
import pandas as pd
import MySQLdb
mysql_cn= MySQLdb.connect(host='localhost',user='root', passwd='', db='option')
df = pd.read_sql('select * from test;', con=mysql_cn)    
mysql_cn.close()
df.head()

,code,date,end_date,start_date,strike,type,vol
0,10000017.SH,2015-02-06 00:00:00.005,2015-04-22 00:00:00.005,2015-02-09 00:00:00.005,2.25,认沽,NaN
1,10000017.SH,2015-02-09 00:00:00.005,2015-04-22 00:00:00.005,2015-02-09 00:00:00.005,2.25,认沽,0.380640
2,10000017.SH,2015-02-10 00:00:00.005,2015-04-22 00:00:00.005,2015-02-09 00:00:00.005,2.25,认沽,0.344061
3,10000017.SH,2015-02-11 00:00:00.005,2015-04-22 00:00:00.005,2015-02-09 00:00:00.005,2.25,认沽,0.292507
4,10000017.SH,2015-02-12 00:00:00.005,2015-04-22 00:00:00.005,2015-02-09 00:00:00.005,2.25,认沽,0.271417

## 更新数据

In [17]:
## to_sql 的时候 if_exists 设置为 'replace
engine = engine = create_engine('mysql://root:@localhost/option')
data.to_sql('test', engine, if_exists='replace')

## 查询数据

In [21]:
pd.read_sql_query('SELECT * FROM test', engine).head()

,index,code,date,end_date,start_date,strike,type,vol
0,0,10000017.SH,2015-02-06 00:00:00.005,2015-04-22 00:00:00.005,2015-02-09 00:00:00.005,2.25,认沽,NaN
1,1,10000017.SH,2015-02-09 00:00:00.005,2015-04-22 00:00:00.005,2015-02-09 00:00:00.005,2.25,认沽,0.380640
2,2,10000017.SH,2015-02-10 00:00:00.005,2015-04-22 00:00:00.005,2015-02-09 00:00:00.005,2.25,认沽,0.344061
3,3,10000017.SH,2015-02-11 00:00:00.005,2015-04-22 00:00:00.005,2015-02-09 00:00:00.005,2.25,认沽,0.292507
4,4,10000017.SH,2015-02-12 00:00:00.005,2015-04-22 00:00:00.005,2015-02-09 00:00:00.005,2.25,认沽,0.271417

## Reading Tables

您可以明确强制将列解析为日期：

In [25]:
pd.read_sql_table('test', engine).dtypes

index           int64
code           object
date           object
end_date       object
start_date     object
strike        float64
type           object
vol           float64
dtype: object

In [24]:
pd.read_sql_table('test', engine, parse_dates=['date', 'start_date', 'end_date']).dtypes

index                  int64
code                  object
date          datetime64[ns]
end_date      datetime64[ns]
start_date    datetime64[ns]
strike               float64
type                  object
vol                  float64
dtype: object

# Mysql 封装

In [2]:
import pandas as pd

In [12]:
from sqlalchemy import create_engine
import MySQLdb

class Mysql_helper():

    def __init__(self, url='localhost',password='', database='option'):
        self.engine = create_engine('mysql://{}:{}@localhost/{}'.format(url,password, database))
        self.db = MySQLdb.connect('localhost', 'root', '', database) 
        self.cur = self.db.cursor()
        
    def insert(self, data, table_name,):
        data.to_sql(table_name, self.engine, if_exists='append', index=False, chunksize=1000)
    
    def read(self, table_name):
        data = pd.read_sql(table_name, self.engine)
        return data
    
    def query(self, sql_query):
        data = pd.read_sql_query(sql_query, self.engine)
        return data
    
    
    def sql(self, sql):        
        try:
            self.cursor.execute(sql)
            self.db.commit()
        except:
            # Rollback in case there is any error
            self.db.rollback()

# Mongodb 封装

In [9]:
from pymongo import MongoClient

class Mongo_helper():    
    def __init__(self, database='option', url='localhost:27017', table=None):
        self.client = MongoClient('mongodb://{}'.format(url))
        self.database = self.client[database]
        if table is not None:
            self.table = self.client[database][table] 
        else:
            self.table = self.database[self.database.collection_names()[0]]
        
    def insert(self, data):
        if type(data) == pd.core.frame.DataFrame:
            self.table.insert_many(data.to_dict('records'))
        else:
            self.table.insert_many(data)
    
    def read_df(self,):
        df = pd.DataFrame(list(self.table.find()))
        return df.drop('_id', axis=1) if df.shape[0]!=0 else None
    
    def query(self, conditions):
        df = pd.DataFrame(list(self.table.find(eval(conditions))))
        return df.drop('_id', axis=1) if df.shape[0]!=0 else None
    
    def update(self, conditions, updata):
        self.table.update_many(eval(conditions),{"$set":eval(updata)})
    
    def delete(self, conditions):
        self.table.delete_many(eval(conditions))

## pymssql